nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
 #include <rtthread.h> 
#include <rthw.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>
#include  <stdio.h>
#include  <string.h>
#include "App_moduleConfig.h"
#include "Device_808.h"


#define   SYSID            0x0712   


ALIGN(RT_ALIGN_SIZE) 
SYS_CONF          SysConf_struct;   //  系统配置  

ALIGN(RT_ALIGN_SIZE) 
JT808_CONF       JT808Conf_struct;   //  JT 808   相关配置 

ALIGN(RT_ALIGN_SIZE) 
TIRED_CONF      TiredConf_struct;    //  疲劳驾驶相关配置




//----------  Basic  Config---------------------------
u8          RemoteIP_regDial[4]={114,242,194,226};//{60,28,50,210};  //  add for 北斗认证
u8          RemoteIP_Dnsr[4]={255,255,255,255};  
u8		RemoteIP_main[4]={114,242,194,226};//{125,38,185,88};//{113,31,28,101 };//{113,31,92,200};//天津{60,28,50,210}; 河北天地通 113,31,28,100                        
u16		RemotePort_main=8217; //8499;// 7804;//9131;//天津9131;   河北天地通 8201              //test tianjin    
u8		RemoteIP_aux[4]={202,96,42,113};    //{60,28,50,210}  //IC 卡认证服务中心地址
                                                                         //   202.96.42.113:11001 
u16		   RemotePort_aux=11001;  
u8           APN_String[30]="CMNET"; //"CMNET";   //  河北天地通  移动的卡
u8           DomainNameStr[50]="jr2.gghypt.net"; ;  // 域名  天地通up.gps960.com //jt1.gghypt.net
u8           DomainNameStr_aux[50]="jr2.gghypt.net";     //"www.sina.com";//jt2.gghypt.net 
u16         ACC_on_sd_Duration=30;    //  ACC 开启的时候 上报的时间间隔  
u16         ACC_off_sd_Duration=60;    //  ACC 关闭时候上报的时间间隔  
u8          TriggerSDsatus=0x80;   // 传感器触发上报状态位 






u32	     Current_SD_Duration=20;  //GPS 信息报告的时间间隔   
u32      Current_SD_Distance=100; // GPS 信息定距上报距离
u32      DistanceAccumulate=0;    // 定距上报累加器
u8		 Current_State=0; //正式为0 ； 演示为1		 // 上报实时标志位信息	 预防DF 损坏 

u16      StopLongDuration=15300; //255minutes 15300s   //超长停车报警最长时间    
u16      Stop_counter=0;               //超长停车的临时计数器
   
u8      EmergentWarn=0;               // 紧急报警

//-------------- Vehicle Recorder Setting --------------------

//---------------------------   驾驶员信息  ------------------------------
//u8     DriverCard_ID[18]="000000000000000000";  // 驾驶员驾驶证号码 18位
//u8     DriveName[21]="张三";                    // 驾驶员 姓名

//-----------------  车辆信息 ------------------------------------------
//u8     Vech_VIN[17]="00000000000000000";        // 车辆VIN号
//u8     Vech_Num[12]="冀A00001";	                // 车牌号
//u8     Vech_Type[12]="000000000000";            // 车辆类型 


//-----------------  车辆信息 ------------------------------------------
//VechINFO  Vechicle_Info; 



u8     Vechicle_TYPE=1;                 //   车辆类型    1:大型货车  2: 小型货车  3:大型客车  4: 中型客车   5:小型客车
u8     OnFire_Status=0;                      //   1 : ACC 点火操作完成     0 :  ACC  关火操作完成 
u8     Login_Status=0x02;                    //   01H:登录，02H：退出，03H：更换驾驶员
u8     Powercut_Status=0x01;                 //01H:上电，02H：断电
u8     Settingchg_Status=0x00;                 /*
												82H:设置车辆信息，84H：设置状态量
												C2H:设置记录仪时钟 
												C3H:设置记录仪速度脉冲系数
											*/
               
//u16    DaySpdMax=0;                                //  当天最大速度
//u16    DayDistance=0;                              //  当天行驶距离

//------ 定距回传 ------

//--------------  定距上报  --------------------
u32  former_distance_meter=0;     //   上一次距离    定距回传时候有用
u32  current_distance_meter=0;    //   当前距离

//---------  SytemCounter ------------------
u32  Systerm_Reset_counter=0;
u8   SYSTEM_Reset_FLAG=0;        // 系统复位标志位 
u32  Device_type=0x00000001; //硬件类型   STM32103  新A1 
u32  Firmware_ver=0x0000001; // 软件版本
u8   ISP_resetFlag=0;        //远程升级复位标志位


//     终端属性相关     1  个版本说明
void ProductAttribute_init(void)
{
     ProductAttribute._1_DevType=0x07; //  客、货、危
     memcpy(ProductAttribute._2_ProducterID,"7_1_2",5);
     memset(ProductAttribute._3_Dev_TYPENUM,0,sizeof(ProductAttribute._3_Dev_TYPENUM));
     memcpy(ProductAttribute._3_Dev_TYPENUM,"TW703_BD",8);

   //终端ID 和SIM卡 ICCID 在初始化时读取

     
     ProductAttribute._6_HardwareVer_Len=14;
     memset(ProductAttribute._7_HardwareVer,0,sizeof(ProductAttribute._7_HardwareVer));
     memcpy(ProductAttribute._7_HardwareVer,"TW703_BD-HW1.0",14);

    ProductAttribute._8_SoftwareVer_len=14;
     memset(ProductAttribute._9_SoftwareVer,0,sizeof(ProductAttribute._9_SoftwareVer));
     memcpy(ProductAttribute._9_SoftwareVer,"TW703_BD-SW1.0",14);

    ProductAttribute._10_FirmWareVer_len=16;
     memset(ProductAttribute._11_FirmWare,0,sizeof(ProductAttribute._11_FirmWare));
     memcpy(ProductAttribute._11_FirmWare,"TW703_BD-Firm1.0",16);

    ProductAttribute._12_GNSSAttribute=0x03;  //   支持GPS 定位 北斗定位  

    ProductAttribute._13_ComModuleAttribute=0x01; // 支持GPRS 通信
		 
};






/*
          创建系统目录
*/
void    Create_Sys_Directory(void)
{
         //  配置 
         Api_DFdirectory_Create(config,config_size);      //   sysconfig
         Api_DFdirectory_Create(jt808,jt808_size);       
         Api_DFdirectory_Create(tired_config,tired_config_size);        //   疲劳驾驶配置

        //   循环存储
         Api_DFdirectory_Create(cyc_gps,cyc_gps_size);    //  gps  数据循环存储      

	//  固定序号	 
	  Api_DFdirectory_Create(event_808, event_size);   // 事件
         Api_DFdirectory_Create(msg_broadcast,msg_broadcast_size);   //  播放消息
         Api_DFdirectory_Create(phonebook,phonebook_size);         //   电话本
         Api_DFdirectory_Create(Rail_cycle,Rail_cycle_size);  
         Api_DFdirectory_Create(Rail_rect,Rail_rect_size);  
         Api_DFdirectory_Create(Rail_polygen,Rail_polygen_size);  
         Api_DFdirectory_Create(turn_point,turn_point_size);        // 拐点
	  Api_DFdirectory_Create(route_line,route_line_size);    // 路线
	  Api_DFdirectory_Create(ask_quesstion,ask_quesstion_size);    // 提问
	  Api_DFdirectory_Create(text_msg,text_msg_size);    // 文本消息



	 //  记录 
         Api_DFdirectory_Create(spd_warn,spd_warn_size);      // 超速报警   
	  Api_DFdirectory_Create(tired_warn,tired_warn_size);    // 疲劳驾驶
	  Api_DFdirectory_Create(doubt_data,doubt_data_size);   // 事故疑点
	  Api_DFdirectory_Create(spdpermin,spdpermin_size);    // 每分钟平均速度
	  Api_DFdirectory_Create(pospermin,pospermin_size);    //  每分钟位置信息  
	  Api_MediaIndex_Init();    //  多媒体索引   图片+  语音
	 // Api_DFdirectory_Create(pic_index,pic_index_size);    //  图片索引
	 // Api_DFdirectory_Create(voice_index,voice_index_size);    //  声音索引


