nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
/*
       提问
*/

void Question_Read(void)
{
	//提问消息	 读出
	  Api_RecordNum_Read(ask_quesstion,1, (u8*)&ASK_Centre,sizeof(ASK_Centre)); 	
	  rt_kprintf("\r\n标志位:%d  流水号:%d  信息长度:%d 回复ID:%d",ASK_Centre.ASK_SdFlag,ASK_Centre.ASK_floatID,ASK_Centre.ASK_infolen,ASK_Centre.ASK_answerID); 

	  rt_kprintf("\r\n信息内容: %s",ASK_Centre.ASK_info); 
	  rt_kprintf("\r\n候选答案: %s",ASK_Centre.ASK_answer); 
}
 
 

/*
        文本信息
*/

void TEXTMsg_Read (void)  
{
  u8 i=0,min=0,max=0;
  
		  for(i=0;i<=7;i++)
		    {
                      Api_RecordNum_Read(text_msg,i+1, (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 			
			memcpy((u8*)&TEXT_Obj_8bak[i],(u8*)&TEXT_Obj,sizeof(TEXT_Obj));     
		    //rt_kprintf("\r\n文本信息 最新:%d  消息TYPE:%d  长度:%d",TEXT_Obj_8bak[i].TEXT_mOld,TEXT_Obj_8bak[i].TEXT_TYPE,TEXT_Obj_8bak[i].TEXT_LEN);  
		    }

		  //最新一条数据
		  max=TEXT_Obj_8bak[0].TEXT_TYPE;    
		  for(i=0;i<=7;i++)
		  	{
		  	if(TEXT_Obj_8bak[i].TEXT_TYPE>max)
				max=TEXT_Obj_8bak[i].TEXT_TYPE;
		  	}
		  TextInforCounter=max;
		  //rt_kprintf("\r\n  最新数据序号  max=%d,TextInforCounter=%d",max,TextInforCounter); 
		  

		  //找出最早的一条信息
		  min=TEXT_Obj_8bak[0].TEXT_TYPE;
		  //rt_kprintf("\r\n  排序前  最老一条信息序号  min=%d",min); 
		  for(i=0;i<=7;i++)
		  	{
		  	if((TEXT_Obj_8bak[i].TEXT_TYPE<min)&&(TEXT_Obj_8bak[i].TEXT_TYPE>0))
				min=TEXT_Obj_8bak[i].TEXT_TYPE;
		  	}
		  //rt_kprintf("\r\n	排序后	最老一条信息序号  min=%d",min); 
  
  if(max<1)return;
  
  if(max<=8)
  	{
  	for(i=1;i<=max;i++)
		{
		Api_RecordNum_Read(text_msg,max-i+1, (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 	
		memcpy((u8*)&TEXT_Obj_8[i-1],(u8*)&TEXT_Obj,sizeof(TEXT_Obj));
		//rt_kprintf("\r\n(<8)消息TYPE:%d  长度:%d",TEXT_Obj_8[i-min].TEXT_TYPE,TEXT_Obj_8[i-min].TEXT_LEN);   
		}
  	}
  else
  	{
  	  max=max%8;
	  //rt_kprintf("\r\n max%8=%d",max);   

	  if(max==0)
	  	{
  		  for(i=0;i<8;i++)
			{
			Api_RecordNum_Read(text_msg,(7-i), (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 	
			memcpy((u8*)&TEXT_Obj_8[i],(u8*)&TEXT_Obj,sizeof(TEXT_Obj));
			//rt_kprintf("\r\n(8*n)i=%d 消息TYPE:%d  长度:%d",i,TEXT_Obj_8[i].TEXT_TYPE,TEXT_Obj_8[i].TEXT_LEN);   
			}
	  	}
	  else
	  	{
		  for(i=0;i<max;i++)
			{
			Api_RecordNum_Read(text_msg,(max-i), (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 
			memcpy((u8*)&TEXT_Obj_8[i],(u8*)&TEXT_Obj,sizeof(TEXT_Obj));
			//rt_kprintf("\r\n(1)消息TYPE:%d  长度:%d",TEXT_Obj_8[i].TEXT_TYPE,TEXT_Obj_8[i].TEXT_LEN);   
			}
		  for(i=7;i>=max;i--)
			{
			Api_RecordNum_Read(text_msg,i+1, (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 
			memcpy((u8*)&TEXT_Obj_8[max+7-i],(u8*)&TEXT_Obj,sizeof(TEXT_Obj));
			//rt_kprintf("\r\n(2)消息TYPE:%d  长度:%d",TEXT_Obj_8[max+7-i].TEXT_TYPE,TEXT_Obj_8[max+7-i].TEXT_LEN);  
			}
	  	}
	  }
}

void TEXTMSG_Write(u8 num,u8 new_state,u8 len,u8 *str)   
{     //  写单条信息
u8 pos_1_8=0;//,i=0;
    //事件写入
       TEXT_Obj.TEXT_mOld=new_state;//是否是最新信息
	TEXT_Obj.TEXT_TYPE=num;// 1
	TEXT_Obj.TEXT_LEN=len; //消息长度
	memset(TEXT_Obj.TEXT_STR,0,sizeof(TEXT_Obj.TEXT_STR));
	memcpy(TEXT_Obj.TEXT_STR,str,TEXT_Obj.TEXT_LEN); 
	
	if(num%8)
		pos_1_8=TEXT_Obj.TEXT_TYPE%8;
	else
		pos_1_8=8; 
        Api_RecordNum_Write(text_msg,pos_1_8, (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 
}

void TEXTMSG_Write_Init(void)
{
    u8  i=0;

       TEXT_Obj.TEXT_mOld=1;//是否是最新信息
	TEXT_Obj.TEXT_TYPE=1;// 1
	TEXT_Obj.TEXT_LEN=0; //消息长度
	memset(TEXT_Obj.TEXT_STR,0,sizeof(TEXT_Obj.TEXT_STR));   

	for(i=0;i<8;i++)
	{
	     //-------------------------------------------------------
             if(i==0)
			  TEXT_Obj.TEXT_mOld=1;//是否是最新信息 	
	      else
		  	    TEXT_Obj.TEXT_mOld=0;//是否是最新信息
           //-------------------------------------------------------
           TEXT_Obj.TEXT_TYPE=i+1;// 1
           Api_RecordNum_Write(text_msg,TEXT_Obj.TEXT_TYPE, (u8*)&TEXT_Obj,sizeof(TEXT_Obj)); 

	}
}


/*
     多媒体索引，用的时候再操作 write / read   初始化话不用处理
*/




void  BD_EXT_initial(void)
{
      //    北斗设置
    BD_EXT.GNSS_Mode=0x03;     //   双模  bit 0 GPS    bit  北斗
    BD_EXT.GNSS_Baud=0x01;     //   9600
    BD_EXT.BD_OutputFreq=0x01;  // 1000ms
    BD_EXT.BD_SampleFrea=1; // 
    BD_EXT.GNSS_Baud_Value=9600;  //  9600   
    //-----  车台相关 ----------------------
    BD_EXT.Termi_Type=0x0001;   //  终端类型
    BD_EXT.Software_Ver=0x0100; //  Ver  1.00
    BD_EXT.GNSS_Attribute=0x54444244;// TDBD
    BD_EXT.GSMmodule_Attribute=0x48554157;// HUAW
    BD_EXT.Device_Attribute=0x00000001; //  终端属性

     //   CAN   相关设置
     BD_EXT.CAN_1_Mode=0xC0000014;    //  CAN  模式  01:还回模式  10  : 普通模式   11:  静默模式  
          /*  bit31  开启  bit 30 -29   模式   bit 15-0   波特率0x14   <=> 20k*/
     BD_EXT.CAN_1_ID=0x01;
     BD_EXT.CAN_1_Type=0;// 扩展帧
     BD_EXT.CAN_1_TransDuration=1;  // 0   表示停止
     BD_EXT.CAN_2_Mode=0xC0000014;   //   CAN  模式 
     BD_EXT.CAN_2_ID=0x02;
     BD_EXT.CAN_2_Type=0;// 扩展帧	 
     BD_EXT.CAN_2_TransDuration=1;  // 0   表示停止
     BD_EXT.Collision_Check=0x0101;     //     关闭震动  0.1g    4ms

  //   位置附加信息
       // 1. 信号强度
      BD_EXT.FJ_SignalValue=0x0000;  //  信号强度   高字节 0 ；低字节  高4为 X2 gprs强度 ，低4位 卫星颗数
      //  2. 自定义状态机模拟量上传  
       BD_EXT.FJ_IO_1=0x00;
	BD_EXT.FJ_IO_2=0x00;
	BD_EXT.AD_0=0x00;  //  2 Byte
	BD_EXT.AD_1=0x00; //   2 Byte
 
       BD_EXT.Close_CommunicateFlag=disable; 
	BD_EXT.Trans_GNSS_Flag=disable;

       Api_Config_Recwrite_Large(BD_ext_config,0,(u8*)&BD_EXT,sizeof(BD_EXT));   
       DF_delay_ms(5);
 
	
}

void BD_EXT_Write(void)
{
    Api_Config_Recwrite_Large(BD_ext_config,0,(u8*)&BD_EXT,sizeof(BD_EXT));   
    DF_delay_ms(15);
}

void BD_EXT_Read(void)
{
    Api_Config_read(BD_ext_config,0,(u8*)&BD_EXT,sizeof(BD_EXT));  	 
}

void  BD_list(void)
{ 
     u8  BD_str[20];
	 
     //-----list -----
     rt_kprintf("\r\n -------北斗扩展信息相关------\r\n ");
     rt_kprintf("\r\n\r\n	 终端类型:    0x%08X      \r\n       软件版本:   0x%08X  \r\n",BD_EXT.Termi_Type,BD_EXT.Software_Ver);  
     rt_kprintf("\r\n\r\n	 GNNS属性:   %04s      \r\n       GSM属性:  %04s    \r\n   终端属性:  0x%08X \r\n\r\n    ",(char*)&BD_EXT.GNSS_Attribute,(char*)&BD_EXT.GSMmodule_Attribute,BD_EXT.Device_Attribute);   

     memset(BD_str,0,sizeof(BD_str));
     switch(BD_EXT.CAN_1_Mode&0x60000000)
     	{
     	    case 0x20000000: 
				memcpy(BD_str,"还回模式",8);
			        break;
	    case 0x40000000:
                           	memcpy(BD_str,"普通模式",8);
			        break;
	    case 0x6000000:
                           	memcpy(BD_str,"静默模式",8);
				break; 

