nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
    rt_kprintf("\r\n Read Config Over \r\n");   
}
void DefaultConfig(void)
{
   u32 DriveCode32=0;
   u8  reg_str[30];

       rt_kprintf("\r\n         SYSTEM ID=0x%X ",SysConf_struct.Version_ID);   
	rt_kprintf("\r\n		   设置的鉴权码为: ");
       rt_kprintf(" %s\r\n		   鉴权码长度: %d\r\n",JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode));   
					   
  if(JT808Conf_struct.Regsiter_Status)
  	   rt_kprintf("\r\n		   该终端已经注册过!    %d \r\n",JT808Conf_struct.Regsiter_Status);  
  else
  	   rt_kprintf("\r\n		   该终端被尚未被注册!\r\n");   
        // APN 设置
	  rt_kprintf("\r\n		   APN 设置 :%s	 \r\n",APN_String); 
         DataLink_APN_Set(APN_String,1);   
            //     域名
          memset(reg_str,0,sizeof(reg_str));
          memcpy(reg_str,DomainNameStr,strlen((char const*)DomainNameStr));
          rt_kprintf("\r\n		  域名设置 :	 %s\r\n",reg_str); 
	      //    域名aux
          memset(reg_str,0,sizeof(reg_str));
          memcpy(reg_str,DomainNameStr_aux,strlen((char const*)DomainNameStr_aux));
          rt_kprintf("\r\n		aux  域名设置 :	 %s\r\n",reg_str); 	    
					  
         // 数据中心IP 地址(4Bytes)  UDP端口号码(2Bytes) TCP端口号码(2Bytes)
         rt_kprintf("\r\n		  主IP: %d.%d.%d.%d : %d \r\n",RemoteIP_main[0],RemoteIP_main[1],RemoteIP_main[2],RemoteIP_main[3],RemotePort_main);   
	  DataLink_MainSocket_set(RemoteIP_main, RemotePort_main,0);
	  rt_kprintf("\r\n		   备用IP: %d.%d.%d.%d : %d \r\n",RemoteIP_aux[0],RemoteIP_aux[1],RemoteIP_aux[2],RemoteIP_aux[3],RemotePort_aux);   
         DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_main,0);	 
         rt_kprintf("\r\n		  IC 卡IP: %d.%d.%d.%d  TCP: %d  UDP:%d\r\n",SysConf_struct.BD_IC_main_IP[0],SysConf_struct.BD_IC_main_IP[1],SysConf_struct.BD_IC_main_IP[2],SysConf_struct.BD_IC_main_IP[3],SysConf_struct.BD_IC_TCP_port,SysConf_struct.BD_IC_UDP_port);   
         rt_kprintf("\r\n		  IC 卡备用IP: %d.%d.%d.%d \r\n",SysConf_struct.BD_IC_Aux_IP[0],SysConf_struct.BD_IC_Aux_IP[1],SysConf_struct.BD_IC_Aux_IP[2],SysConf_struct.BD_IC_Aux_IP[3]);   
         DataLink_IC_Socket_set(SysConf_struct.BD_IC_main_IP,SysConf_struct.BD_IC_TCP_port,0); 

	  //  ACC On 上报间隔(2Bytes)  ACC Off 上报间隔(2Bytes)
	  rt_kprintf("\r\n		   ACC on 发送间隔为: %d S\r\n		   ACC Off 发送间隔为: %d S\r\n",ACC_on_sd_Duration,ACC_off_sd_Duration);
					  
          //  超长停车报警(2Bytes)	
	  rt_kprintf("\r\n		   超长停车报警: %d S\r\n",StopLongDuration);
	   //  定距离回传使能标志位(1Bytes) ， 定距离上传距离(4Bytes)  单位: m 米  
         rt_kprintf("\r\n         监听号码: %s \r\n",JT808Conf_struct.LISTEN_Num);  


	   
          //   记录仪唯一ID
         rt_kprintf("\r\n		   车辆唯一性编号: %35s \r\n",JT808Conf_struct.DeviceOnlyID);    
         rt_kprintf("\r\n		   上报速度获取方式: %d :",JT808Conf_struct.Speed_GetType);	  
         if(JT808Conf_struct.Speed_GetType)							
                rt_kprintf("车速通过车辆速度传感器获取!\r\n");
         else
                rt_kprintf("车速通过GPS模块获取!\r\n"); 


         rt_kprintf(" \r\n  ------------------------GPS 外接信号源状态 JT808Conf_struct.OutGPS_Flag= %d",JT808Conf_struct.OutGPS_Flag);  

         rt_kprintf("\r\n		   特征系数校准状态: %d :",JT808Conf_struct.DF_K_adjustState);	    
         if(JT808Conf_struct.DF_K_adjustState)					  	 
                  rt_kprintf(" 特征系数--校准成功!\r\n");
         else
                  rt_kprintf("特征系数--尚未校准!\r\n");   

	  //   里程
         rt_kprintf("\r\n		   累计里程: %d  米   ,  当日里程:   %d米\r\n",JT808Conf_struct.Distance_m_u32,JT808Conf_struct.Distance_m_u32-JT808Conf_struct.DayStartDistance_32);  	
         //  速度限制
         rt_kprintf("		   允许最大速度: %d  Km/h  预报警数值 : %d  Km/h  超速报警持续时间门限: %d  s \r\n", JT808Conf_struct.Speed_warn_MAX,JT808Conf_struct.BD_MaxSpd_preWarnValue,JT808Conf_struct.Spd_Exd_LimitSeconds);  		 

         rt_kprintf("\r\n		  国家标准版本: %14s \r\n",JT808Conf_struct.StdVersion.stdverStr);					  
         rt_kprintf("\r\n		  国家标准版本修改单号: %d \r\n",JT808Conf_struct.StdVersion.MdfyID); 


         rt_kprintf("\r\n		  特征系数(速度脉冲系数): %d \r\n",JT808Conf_struct.Vech_Character_Value); 					  
         rt_kprintf("\r\n		  初次安装日期: %X-%X-%X %X:%X:%X \r\n",JT808Conf_struct.FirstSetupDate[0],JT808Conf_struct.FirstSetupDate[1],JT808Conf_struct.FirstSetupDate[2],JT808Conf_struct.FirstSetupDate[3],JT808Conf_struct.FirstSetupDate[4],JT808Conf_struct.FirstSetupDate[5]);  


         DriveCode32=(JT808Conf_struct.Driver_Info.DriveCode[0]<<16)+(JT808Conf_struct.Driver_Info.DriveCode[1]<<8)+JT808Conf_struct.Driver_Info.DriveCode[2];
         rt_kprintf("\r\n		  驾驶员代码: %d \r\n",DriveCode32);  					  
         rt_kprintf("\r\n		  机动车驾驶证号: %18s \r\n",JT808Conf_struct.Driver_Info.DriverCard_ID);  					  
         rt_kprintf("\r\n		  驾驶员姓名: %s \r\n",JT808Conf_struct.Driver_Info.BD_DriveName); 					  
         rt_kprintf("\r\n		  驾驶员从业资格证: %40s \r\n",JT808Conf_struct.Driver_Info.BD_Drv_CareerID); 
         rt_kprintf("\r\n		  发证机构: %s \r\n",JT808Conf_struct.Driver_Info.BD_Confirm_agentID);    



         rt_kprintf("\r\n		  车辆VIN号: %17s \r\n",JT808Conf_struct.Vechicle_Info.Vech_VIN);   
         rt_kprintf("\r\n		  车牌号码: %12s \r\n",JT808Conf_struct.Vechicle_Info.Vech_Num);  
         rt_kprintf("\r\n		  车牌分类: %12s \r\n",JT808Conf_struct.Vechicle_Info.Vech_Type);  
         rt_kprintf("\r\n        车辆所在省ID: %d \r\n",JT808Conf_struct.Vechicle_Info.Dev_ProvinceID);
         rt_kprintf("\r\n        车辆所在市ID: %d \r\n",JT808Conf_struct.Vechicle_Info.Dev_CityID); 
         rt_kprintf("\r\n        车辆颜色:   JT415    1  蓝 2 黄 3 黑 4 白 9其他----当前颜色 %d \r\n",JT808Conf_struct.Vechicle_Info.Dev_Color);  


         rt_kprintf("\r\n        触发上报传感器为  TriggerSDsatus=%X    \r\n",TriggerSDsatus);   
         rt_kprintf("\r\n        Max_picNum =  %d   Max_CycleNum = %d   Max_DrvRcdNum=%d \r\n",Max_PicNum,Max_CycleNum,Max_RecoderNum); 

         rt_kprintf("\r\n        疲劳驾驶门限 连续驾驶门限 =  %d s   当天累计驾驶门限 = %d s   最小休息门限=%d s  最长停车门限= %d s\r\n",TiredConf_struct.TiredDoor.Door_DrvKeepingSec,TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec,TiredConf_struct.TiredDoor.Door_MinSleepSec,TiredConf_struct.TiredDoor.Door_MaxParkingSec); 
         rt_kprintf("\r\n        疲劳驾驶状态 Status_TiredwhRst =  %d   ACCON_timer = %d   ACCOFF_timer=%d \r\n",TiredConf_struct.Tired_drive.Status_TiredwhRst,TiredConf_struct.Tired_drive.ACC_ONstate_counter,TiredConf_struct.Tired_drive.ACC_Offstate_counter); 
         if(TiredConf_struct.Tired_drive.Status_TiredwhRst==2)
                  rt_kprintf("\r\n		  疲劳驾驶起始时间: %X-%X-%X %X:%X:%X \r\n",TiredConf_struct.Tired_drive.start_time[0],TiredConf_struct.Tired_drive.start_time[1],TiredConf_struct.Tired_drive.start_time[2],TiredConf_struct.Tired_drive.start_time[3],TiredConf_struct.Tired_drive.start_time[4],TiredConf_struct.Tired_drive.start_time[5]);  


         rt_kprintf("\r\n\r\n        心跳包发送间隔 =	%d s   TCP应答超时Dur = %d s	 TCP重传次数=%d 	驾驶员未登录时上报间隔= %d s\r\n",JT808Conf_struct.DURATION.Heart_Dur,JT808Conf_struct.DURATION.TCP_ACK_Dur,JT808Conf_struct.DURATION.TCP_ReSD_Num,JT808Conf_struct.DURATION.NoDrvLogin_Dur); 
         rt_kprintf("\r\n\r\n                                 UDP应答超时Dur = %d s	 UDP重传次数=%d 	                             \r\n",JT808Conf_struct.DURATION.UDP_ACK_Dur,JT808Conf_struct.DURATION.UDP_ReSD_Num);  
         rt_kprintf("\r\n        休眠时上报间隔 =	%d s   紧急报警时上报间隔 = %d s	缺省上报间隔=%d s	拐点上次角度= %d ° 非法移动阈值= %d m\r\n",JT808Conf_struct.DURATION.Sleep_Dur,JT808Conf_struct.DURATION.Emegence_Dur,JT808Conf_struct.DURATION.Default_Dur,JT808Conf_struct.DURATION.SD_Delta_maxAngle,JT808Conf_struct.BD_CycleRadius_DoorValue); 

         rt_kprintf("\r\n\r\n		  缺省定距上报 =	 %d m	驾驶员未登录定距 = %d m	 休眠定距=%d m	 紧急报警定距= %d m \r\n",JT808Conf_struct.DISTANCE.Defalut_DistDelta,JT808Conf_struct.DISTANCE.NoDrvLogin_Dist,JT808Conf_struct.DISTANCE.Sleep_Dist,JT808Conf_struct.DISTANCE.Emergen_Dist); 

         rt_kprintf("\r\n\r\n		定时上报方式 = %d    定时缺省 = %d   定时未登录=%d  定时休眠=%d m   定时紧急= %d m \r\n",JT808Conf_struct.SD_MODE.DUR_TOTALMODE,JT808Conf_struct.SD_MODE.Dur_DefaultMode,JT808Conf_struct.SD_MODE.Dur_NologinMode,JT808Conf_struct.SD_MODE.Dur_SleepMode,JT808Conf_struct.SD_MODE.Dur_EmegencMode); 
         rt_kprintf("\r\n\r\n		定距上报方式 = %d    定距缺省 = %d   定距未登录=%d  定距休眠=%d m   定距紧急= %d m \r\n",JT808Conf_struct.SD_MODE.DIST_TOTALMODE,JT808Conf_struct.SD_MODE.Dist_DefaultMode,JT808Conf_struct.SD_MODE.Dist_NoLoginMode,JT808Conf_struct.SD_MODE.Dist_SleepMode,JT808Conf_struct.SD_MODE.Dist_EmgenceMode);  


         rt_kprintf("\r\n\r\n	   临时位置跟踪状态= %d    跟踪间隔 = %d  	持续时间=%d  持续当前计数器=%d  \r\n",JT808Conf_struct.RT_LOCK.Lock_state,JT808Conf_struct.RT_LOCK.Lock_Dur,JT808Conf_struct.RT_LOCK.Lock_KeepDur,JT808Conf_struct.RT_LOCK.Lock_KeepCnter);  
         rt_kprintf("\r\n\r\n	  车辆负载状态: ");

				 Car_Status[2]&=~0x03;  
    switch(JT808Conf_struct.LOAD_STATE) 
		{  
		
		case 1:
		   rt_kprintf("空车\r\n"); 
		   
		  break;
		case 2:
		   rt_kprintf("半载\r\n"); 
		   Car_Status[2]|=0x01;   //半载
		  break;		  
		case 3:
		   rt_kprintf("满载\r\n"); 
		   Car_Status[2]|=0x03;   //满载
		  break;
		default:
		       JT808Conf_struct.LOAD_STATE=0;
		       Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		   rt_kprintf("空车2\r\n");  
		  break;
		}
            rt_kprintf("\r\n\r\n  起始流水号: %d \r\n", JT808Conf_struct.Msg_Float_ID); 
	     rt_kprintf("\r\n\r\n             cyc_read:   %d ,     cyc_write :%d\r\n  \r\n",cycle_read,cycle_write);     		
            //cycle_write=cycle_read;
             rt_kprintf("\r\n\r\n 是否关闭通信: %d \r\n", JT808Conf_struct.Close_CommunicateFlag);  
	      memset(reg_str,0,sizeof(reg_str));
	      memcpy(reg_str,JT808Conf_struct.Vechicle_Info.Vech_sim,12);  
	       rt_kprintf("\r\n	DeviceID=%s \r\n  Tired prewarn %d   jt808:%d  位置汇报策略:%d  ",reg_str, TiredConf_struct.Tired_drive.PreWarn_Dur,JT808Conf_struct.BD_TiredDrv_preWarnValue,JT808Conf_struct.PositionSd_Stratage);   

		 //=====================================================================
         //API_List_Directories();
         //-----------  北斗模块相关  ---------
	  BD_list(); 
 
