nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
}

/*
读参数配置文件
*/
	void SysConfiguration(void)
	{
			SetConfig();  
			ReadConfig();
			DefaultConfig();      
	}


	 


void RstWrite_ACConoff_counter(void) 
{
 
  if(TiredConf_struct.Tired_drive.Status_TiredwhRst==0)
  	return;
    Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
}
//-------------------------------------------------------------------------------



void  idip(u8 *str)
{
   u8 Reg_buf[25];
   
    if (strlen((const char*)str)==0){
	  	rt_kprintf("\r\n		   当前鉴权码为: ");
              rt_kprintf(" %s\r\n		   鉴权码长度: %d\r\n",JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode));   

		return ;
	}
   else
   	{	
   	    if(strncmp((const char*)str,"clear",5)==0)
   	    	{
                   JT808Conf_struct.Regsiter_Status=0; 
		     rt_kprintf("     手动清除 鉴权码 !\r\n");   		   
   	    	}
		else
	      {
                  memset(JT808Conf_struct.ConfirmCode,0,sizeof(JT808Conf_struct.ConfirmCode));
                  memcpy(JT808Conf_struct.ConfirmCode,str,strlen((const char*)str));
		     JT808Conf_struct.Regsiter_Status=1; 
		    rt_kprintf("     手动设置  鉴权码: %s\r\n",JT808Conf_struct.ConfirmCode);   
	 
		}  
		    memset(Reg_buf,0,sizeof(Reg_buf));
		    memcpy(Reg_buf,JT808Conf_struct.ConfirmCode,20); 
		    Reg_buf[20]=JT808Conf_struct.Regsiter_Status;			
                  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
      }
}
FINSH_FUNCTION_EXPORT(idip, id code set);














